gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_REPORT.c


#include "Project698.h"
#include "../DL698/DL698_DataDef.h"
#include "../DL698/DL698_REPORT.h"
#include "../DL698/TASK.h"
#include "../DL698/DL698_Uart.h"
#include "../DL698/DL698_SETLIB.h"
#include "../DL698/DL698_GET.h"
#include "../DL698/RM_Record.h"
#include "../DL698/EVENT_Record.h"

#include "../STM32F4xx/STM32F4xx_UART.h"
#include "../Device/MEMRW.h"
#include "../Device/IC_TESAM.h"
#include "../MS/msFILE.h"
#include "../MS/MS.h"
#include "../Calculate/Calculate.h"

#include "../DL698/DL698_JSON.h"


void RM_Monitor(u32 ID,u32 NUM_Tx,u32 NUM_Rx);//采集任务监控;入口:ID=任务号,NUM_Tx=发送条数,NUM_Rx=接收条数

//REPORT-Notification∷=CHOICE
//{
//上报若干个对象属性         [1] ReportNotificationList，
//上报若干个记录型对象属性   [2] ReportNotificationRecordList
//}


void REPORT_PORTn(msFILE_TypeDef *file)//通道不需上报时置已上报数据个数=当前数据个数；使用ADDR_DATABUFF
{
/*
	u32 i;
	u32 n;
	u32 OI;
	u32 NUM_DATA;
	u8* p8;
	
	NUM_DATA=file->NUM_DATA;
	MR(ADDR_DATABUFF,ADDR_4300_10,LENmax_4300_10);//上报通道
	p8=(u8*)ADDR_DATABUFF;
	n=p8[1];//数组数
	p8+=2;
	for(i=0;i<n;i++)
	{
		OI=(p8[1]<<8)|p8[2];
		if(OI==0x4500)//GPRS
		{
			break;
		}
		p8+=5;
	}
	if(i>=n)
	{//GPRS非上报通道
		for(i=0;i<NUMmax_601C;i++)
		{
			file->NUM_GPRSreport[i]=NUM_DATA;
		}
	}
	p8=(u8*)ADDR_DATABUFF;
	p8+=2;
	for(i=0;i<n;i++)
	{
		OI=(p8[1]<<8)|p8[2];
		if(OI==0x4510)//ENET
		{
			break;
		}
		p8+=5;
	}
	if(i>=n)
	{//ENET非上报通道
		for(i=0;i<NUMmax_601C;i++)
		{
			file->NUM_ENETreport[i]=NUM_DATA;
		}
	}
*/
}
	
void REPORT_complete(u32 PORTn)//主动上报完成后处理(定时任务)
{
	u32 i;
	u32 x;
	u32 n;
	u32 id;
	u32 filename;
	msFILE_TypeDef *file;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	x=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
	UARTCtrl->REPORT_NUM_File=0;//1帧主动上报数据来自不同文件的个数
	
	if(UARTCtrl->HostACK==5)//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
	{
		id=UARTCtrl->TaskID;
		id&=0xff;//上报方案号
		if(id<NUMmax_601C)
		{
			if((x!=0)&&(x<=REPORT_NUMFILEmax))
			{
				Comm_Ram->msFILEchange=0;//文件管理数据变化:0=变化,!=没变化
				for(i=0;i<x;i++)
				{
					filename=UARTCtrl->REPORT_filename[i];//当前正在上报数据的文件名,0xffff表示无效文件名
					if(filename<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM))
					{
						if(filename<recordFILENAMEmax_FLASH)
						{
							file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
						}
						else
						{
							file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-recordFILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
						}
						n=UARTCtrl->REPORT_NUM_Data[i];
					#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
						if(PORTn==GPRSPORT)
						{
							file->NUM_GPRSreport[id]+=n;//当前正在上报数据的文件中包含有电能表的个数或事件个数
						}
						else
						{
							file->NUM_ENETreport[id]+=n;//当前正在上报数据的文件中包含有电能表的个数或事件个数
						}
					#else
						file->NUM_GPRSorENETreport[id]+=n;//当前正在上报数据的文件中包含有电能表的个数或事件个数
					#endif
					}
				}
			}
		}
		UARTCtrl->HostACK=0;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
	}
}

void REPORT_END(u32 PORTn)//主动上报任务结束时间(定时任务)
{
	u32 i;
	u32 id;
	UARTCtrl_TypeDef *UARTCtrl;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	i=UARTCtrl->TaskID;
	id=(i>>8)&0xff;//任务号
	if(id>=NUMmax_6012_2)
	{
		return;
	}
	UARTCtrl->TaskTime[id].Run=2;//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
	for(i=0;i<7;i++)
	{
		UARTCtrl->TaskTime[id].EndTime[i]=Comm_Ram->DL698YMDHMS[i];//任务执行结束时间YYMDHMS
	}
}

//#define ADDR_601C     ADDR_6018+LENmax_6018///上报方案集(初始化值0x00)
//属性2（上报方案 report plan）∷=structure//删除时structure的数据单元清为0(NULL)
//{
//方案编号          unsigned，
//上报通道          array OAD，
//上报响应超时时间  TI，
//最大上报次数      unsigned，
//上报内容          strcuture
//{
//  类型  unsigned，
//  数据  Data
//}
//}
//上报内容：
//上报类型	  上报内容	表示
// 0	      OAD	对象属性数据
// 1	      RecordData	上报记录型对象属性
//RecordData∷=structure
//{
//  主对象属性描述符      OAD，
//	记录型对象属性描述符  RCSD，
//	行选择                RSD
//}
//#define LENper_601C     512
#include "../DL698/DL698_JSON.h"
void REPORT_Notification(u32 PORTn)//上报通知(定时任务)
{
	u32 i;
	u32 x;
	u32 n;
	u32 TaskID;
	u32 id;
	u32 reportid;
	u32 fileid;
	u32 OAD;
	u32 LEN_Tx;
	//u32 TxByte;
	u32 LEN_TxAPDU;
	u32 LENmax_TxSPACE;//最大还可发送的字节数
	u8* p8;
	u32 NUM_RCSD;
	u32 LEN_RCSD;
	u8* pRCSD;
	u8* pRSD;
	u32 fRSD;//行选择有效标志
	u32 FILECOUNT;
	u32 FILE_OFFSET;
	u32 fDATA;//有数据标志
	u32 NUM_READFILE;//读文件总次数
	u16* p16time;
	u8* p8tx;
	UARTCtrl_TypeDef *UARTCtrl;
	ClientConnectInfo_TypeDef *ClientConnectInfo;//客户机连接信息
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	RecordFileHead_TypeDef* RecordFileHead;//抄表记录文件头文件
	u32 ProjectType;//方案类型
	
	
	if((PORTn!=GPRSPORT)&&(PORTn!=ENETPORT))
	{
		return;
	}
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(UARTCtrl->Task!=0)
	{
		return;
	}
	if(UARTCtrl->LinkTask!=101)
	{//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
		return;
	}
	//myprintf("111111111111111111111111111\n", 0, 0, 0);

//---用RS232口测试上报---
	
//	if(PORTn!=RS232PORT)
//	{
//		return;
//	}
//	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
//	if(UARTCtrl->Task!=0)
//	{
//		return;
//	}
	
//---用RS232口测试上报 END---
	

	//myprintf("UARTCtrl->HostACK=%d\n", UARTCtrl->HostACK, 0, 0);
	if((UARTCtrl->HostACK)&&((UARTCtrl->HostACK!=5)&&(UARTCtrl->HostACK!=8)))//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件
	{//有其他主动上报等待确认返回
		return;
	}
	i=Comm_Ram->DL698YMDHMS[6];
	if(UARTCtrl->REPORT_RTCS==i)//空闲时进入上报的RTC秒
	{
		//myprintf("空闲时进入上报的RTC秒\n", 0, 0, 0);
		return;
	}
	if(i&1)
	{
		return;//当前时钟奇数秒,奇数报事件,偶数报定时任务
	}
	UARTCtrl->REPORT_RTCS=i;//空闲时进入上报的RTC秒
	i=MRR(ADDR_4300_8+1,1);//允许主动上报
	if(i==0)
	{//不允许主动上报
		UARTCtrl->REPORT_NUMmax=0;//若主站没应答最大还需重发上报次数,每上报1次减1
		//不需主动上报的文件数据上报计数处理
		/*
		Comm_Ram->msFILEchange=0;//文件管理数据变化:0=变化,!=没变化(1=管理数据保存,2=不需主动上报处理)
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
		for(filename=0;filename<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM);filename++)
		{
			if(filename==recordFILENAMEmax_FLASH)
			{
				file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
			}
			if(file->BLOCK_ENTRY)
			{
				x=file->NUM_DATA;
				for(i=0;i<RMTASKmax;i++)
				{
					file->NUM_REPORT[i]=x;
				}
			}
			file++;
		}
		*/
		return;
	}
	switch(PORTn)
	{
		case GPRSPORT:
			p16time=(u16*)&Terminal_Ram->GPRS_WaitHostACK_S_Timer;//29 GPRS主动上报等待主站确认秒定时器
			break;
		case ENETPORT:
			p16time=(u16*)&Terminal_Ram->ENET_WaitHostACK_S_Timer;//30 ENET主动上报等待主站确认秒定时器
			break;
		default:
		case RS232PORT:
			p16time=(u16*)&Terminal_Ram->RS232_WaitHostACK_S_Timer;//31 RS232主动上报等待主站确认秒定时器
			break;
	}
	if(p16time[0]!=0)
	{//上报响应超时时间没到
		return;
	}
	i=UARTCtrl->REPORT_NUMmax;//若主站没应答最大还需重发上报次数,每上报1次减1
	if(i)
	{
		i--;
		UARTCtrl->REPORT_NUMmax=i;//若主站没应答最大还需重发上报次数,每上报1次减1
		p16time[0]=UARTCtrl->REPORT_OVER_SECOND;//上报响应超时时间寄存
		p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
		p8=(u8*)Get_ADDR_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲地址
		i=Get_LEN_UARTnTx(PORTn);
		p8+=i;
		LEN_Tx=p8[1]|(p8[2]<<8);
		LEN_Tx+=2;
		if(LEN_Tx<=i)
		{
			MR((u32)p8tx,(u32)p8,LEN_Tx);
			UARTCtrl->TxByte=LEN_Tx;
			UARTCtrl->Task=2;//2=等待单帧数据发送
		}
		return;
	}
	REPORT_complete(PORTn);//当前主动上报完成后处理(定时任务)
	
#if(Project/100==2)&&(USER/100==17)//江苏集中器
	if(Terminal_Router->MinuteCollect!=0)
	{
		i=Report_JsonFile(p16time,PORTn);
		if(i)
		{
			return;
		}
	}
#endif
//心跳优先
	if(PORTn==GPRSPORT)
	{
		if(Terminal_Ram->GPRSHeartBeat_S_Timer==0)//GPRS心跳秒定时器
		{
			#if(Project/100==2)&&(USER/100==17)//江苏集中器
			if(UARTCtrl->HostACK==8)//江苏
			{
				UARTCtrl->HostACK=3;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
			}
			#endif
			return;
		}
	}
	if(PORTn==ENETPORT)
	{
		if(Terminal_Ram->ENETHeartBeat_S_Timer==0)//以太网心跳秒定时器
		{
			#if(Project/100==2)&&(USER/100==17)//江苏集中器
			if(UARTCtrl->HostACK==8)//江苏
			{
				UARTCtrl->HostACK=3;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
			}
			#endif
			return;
		}
	}
	
	

	TASK(PORTn,0);//任务;入口:RM=0上报任务,RM=1采集任务
	TaskID=UARTCtrl->TaskID;
	id=(TaskID>>8)&0xff;//任务号
	#if (USER/100)==15//安徽
	if(id==16)
	{
		n=2;//任务ID=2
		RM_Monitor(2,0,0);
		p8=(u8*)ADDR_6034+(n*LENper_6034);
		p8=Get_Element(p8,2,0,0);
		if(p8)
		{
			if(p8[0]!=0x16||p8[1]!=0x02)
			{
				return;
			}
		}
		else
			return;
	}
	#endif
	if(TaskID)
	{//有上报任务
//TaskID=b31-b28优先级,b27-b24方案类型,b23-b20采集类型,b19-b16存储时标类型,b15-b8任务号,b7-b0方案编号
//b31-b28优先级:1=首要,2=必要,3=需要,4=可能
//b27-b24方案类型:1=普通采集方案,2=事件采集方案,3=透明方案,4=上报方案,5=脚本方案
//b23-b20普通采集方案的采集类型:0=采集当前数据,1=采集上第N次,2=按冻结时标采集,3=按时标间隔采集,4=补抄
//b19-b16普通采集方案的存储时标:0=未定义,1=任务开始时间,2=相对当日0点0分,3=相对上日23点59分,4=相对上日0点0分,5=相对当月1日0点0分,6=数据冻结时标,7=相对上月月末23点59分
		if(id>=NUMmax_6012_2)
		{
			return;
		}
		if(UARTCtrl->TaskTime[id].Run==2)//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
		{
			return;
		}
		reportid=TaskID&0xff;//上报方案号
		if(reportid>=NUMmax_601C)
		{//方案编号超
			REPORT_END(PORTn);//主动上报任务结束时间
			return;
		}
		p8=(u8*)ADDR_601C_SDRAM+((TaskID&0xff)*LENper_601C);
		if(p8[0]!=DataType_structure)
		{//删除
			REPORT_END(PORTn);//主动上报任务结束时间
			return;
		}
		//上报方案中的上报通道
		x=PORTntoOAD(PORTn);//通信口号转为OAD值
		p8+=4;
		n=p8[1];//数组数
		p8+=2;
		x>>=16;
		for(i=0;i<n;i++)
		{
			OAD=(p8[1]<<8)|p8[2];
			if(OAD==x)
			{
				break;
			}
			p8+=5;
		}
		if(i>=n)
		{//非上报端口
/*
			if(reportid!=0)//上报方案号
			{
				Comm_Ram->msFILEchange=0;//文件管理数据变化:0=变化,!=没变化
				file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
				for(filename=0;filename<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM);filename++)
				{
					if(filename==recordFILENAMEmax_FLASH)
					{
						file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
					}
					if(file->BLOCK_ENTRY)
					{
						x=file->NUM_DATA;
						if(PORTn==GPRSPORT)
						{
							file->NUM_GPRSreport[reportid]=x;
						}
						else
						{
							file->NUM_ENETreport[reportid]=x;
						}
					}
					file++;
				}
			}
*/
			REPORT_END(PORTn);//主动上报任务结束时间
			return;//非上报通道
		}
		//
		p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
		LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
		LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
	#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
		ClientConnectInfo=ClientConnectInfo;
	#else
		//客户机接收缓冲长度
		ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
		i=ClientConnectInfo->LEN_Rx;
		i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
		if(i<2048)
		{
			i=2048;
		}
		if(i>(TxAPDUOffset+1))
		{//不为0
			i-=(TxAPDUOffset+1);
			if(LENmax_TxSPACE>i)
			{
				LENmax_TxSPACE=i;
			}
		}
	#endif
		//上报内容
		p8=(u8*)ADDR_601C_SDRAM+((TaskID&0xff)*LENper_601C);
		p8=Get_Element(p8,5,0,0);//计算元素地址,使用ADDR_128KDATABUFF
		if(p8==0)
		{
			REPORT_END(PORTn);//主动上报任务结束时间
			return;
		}
		if(p8[3]==0)
		{//0=OAD	对象属性数据
			REPORT_END(PORTn);//主动上报任务结束时间(定时任务)
			p8+=4;
			if(p8[0]==DataType_array)
			{
				n=p8[1];
				p8+=2;
			}
			else
			{
				n=1;
			}
		//APDU：88 01 01 01 40 00 02 00 01 1C 07 E0 0B 0E 00 02 00 00 00 
			p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
			p8tx[0]=0x88;//上报通知 REPORT-Notification
			p8tx[1]=0x01;//上报若干个对象属性         [1] ReportNotificationList
									//上报若干个记录型对象属性   [2] ReportNotificationRecordList
			i=UARTCtrl->REPORT_PIID;
			i++;
			i&=0x3f;
			UARTCtrl->REPORT_PIID=i;
			p8tx[2]=i;//PIID
			p8tx[3]=0;//SEQUENCE OF OAD，个数=?
			LEN_TxAPDU=4;
			LENmax_TxSPACE-=LEN_TxAPDU+2;//保留2byte(1byte时间标签,1byte上报信息FollowReport OPTIONAL）
			
			while(n--)
			{
				if(LENmax_TxSPACE<6)
				{
					break;
				}
				MR((u32)p8tx+LEN_TxAPDU,(u32)p8+1,4);
				LENmax_TxSPACE-=4;
				UARTCtrl->NEXT=0;//DL698分帧标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧
				i=(p8[1]<<24)|(p8[2]<<16)|(p8[3]<<8)|p8[4];
				p8+=5;
				i=GET_OAD_DATA(PORTn,i,p8tx+LEN_TxAPDU+4+1,LENmax_TxSPACE-1);//读一个对象属性;返回:本对象的数据长度,数据访问结果UARTCtrl->DAR
				if(UARTCtrl->NEXT!=0)//DL698分帧传输标志:0=不分帧,1=分帧第1帧,2=分帧中间帧,3=分帧最后帧;B7位=1表示已在发送区的APDU再分帧传输
				{
					break;
				}
				LEN_TxAPDU+=4;
				if(UARTCtrl->DAR!=0)//数据访问结果
				{
					p8tx[LEN_TxAPDU+0]=0;//Get-Result∷=CHOICE,错误信息  [0]   DAR
					p8tx[LEN_TxAPDU+1]=UARTCtrl->DAR;
					LEN_TxAPDU+=2;
					LENmax_TxSPACE-=2;
				}
				else
				{
					p8tx[LEN_TxAPDU]=1;//Get-Result∷=CHOICE,  [1]   DATA
					LEN_TxAPDU+=i+1;
					LENmax_TxSPACE-=i+1;
				}
				p8tx[3]++;//SEQUENCE OF OAD，个数=?
			}
			p8tx[LEN_TxAPDU+0]=0;//时间标签
			p8tx[LEN_TxAPDU+1]=0;//上报信息FollowReport OPTIONAL
			LEN_TxAPDU+=2;
			
