gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_REPORT.c
		}
		else
		{//1=RecordData	上报记录型对象属性
			//先计算上报的数据在抄表方案后,然后由方案号确定任务号用以文件搜索.
			p8+=6;
//RecordData∷=structure
//{
//  主对象属性描述符      OAD，
//	记录型对象属性描述符  RCSD，
//	行选择                RSD
//}
//02 03
//51 60 12 03 00 主对象属性描述符      OAD
//60 01 RCSD∷=SEQUENCE OF CSD
//01 50 04 02 00 02 00 10 02 00 00 20 02 00 
//5a 00 行选择                RSD
			//主对象属性描述符 OAD
			OAD=(p8[1]<<24)|(p8[2]<<16)|(p8[3]<<8)|p8[4];
			switch(OAD)
			{
				case 0x60120300:
					ms=(ms_Type *)Get_ms();
					pRCSD=p8+5;//记录型对象属性描述符  RCSD
					i=Get_DL698DataLen_S(pRCSD,0);//得到DL698数据类型长度(包括:类型字节和数据)
				
					pRSD=pRCSD+i;//行选择 RSD
					fileid=RCSDtoFileID(pRCSD);//记录列选择RCSD相对应的FileID,返回:0表示没找到无效FileID,当有2个上相同方案时TaskNO字段=0xff;RCSD中只有通信地址等非抄表类数据时返回0xffffffff
					if((fileid==0)||(fileid==0xffffffff))
					{//0表示没找到,无效FileID
						UARTCtrl->TaskTime[id].Run=2;//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
						return;
					}
					ProjectType=fileid>>28;//方案类型
					if(ProjectType==1)
					{//普通采集方案
						fileid>>=20;
					}
					else
					{
						fileid>>=12;
						fileid&=0xff;
					}
					//找文件中数据上报
//TxAPDU：
//88 上报通知
//02 上报若干个记录型对象属性
//02 PIID
//01 SEQUENCE OF A-ResultNormal
//60 12 03 00  OAD
//01 RCSD，SEQUENCE OF个数=1
//01 50 04 02 00 02 00 10 02 00 00 20 02 00 //RCSD
//01 记录数据
//02 M条记录，M=2
//01 02 01 05 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 01 05 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 
//01 02 01 05 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 01 05 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 
//00 00 
					p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
					p8tx[0]=0x88;//上报通知 REPORT-Notification
					p8tx[1]=0x02;//上报若干个对象属性[1] ReportNotificationList,上报若干个记录型对象属性   [2] ReportNotificationRecordList
					i=UARTCtrl->REPORT_PIID;
					i++;
					i&=0x3f;
					UARTCtrl->REPORT_PIID=i;
					p8tx[2]=i;//PIID
					//SEQUENCE OF A-ResultNormal
					//A-ResultNormal∷=SEQUENCE
					//{
					//  对象属性描述符  OAD，
					//  及其结果        Get-Result
					//}
					//Get-Result∷=CHOICE
					//{
					//  错误信息  [0]   DAR，
					//  数据      [1]   Data
					//}
					p8tx[3]=1;//SEQUENCE OF A-ResultNormal
					p8tx[4]=0x60;
					p8tx[5]=0x12;
					p8tx[6]=0x03;
					p8tx[7]=0x00;
					//RCSD总长度
					NUM_RCSD=pRCSD[1];//RCSD，SEQUENCE OF个数
					LEN_RCSD=0;
					for(n=0;n<NUM_RCSD;n++)
					{
						x=pRCSD[2+LEN_RCSD];
						if(x==0)
						{//OAD
							LEN_RCSD+=5;
						}
						else
						{//ROAD
							x=pRCSD[2+LEN_RCSD+5];
							x*=4;
							x+=6;
							LEN_RCSD+=x;
						}
					}
					p8tx[8]=NUM_RCSD;
					MR((u32)p8tx+9,(u32)pRCSD+2,LEN_RCSD);
					p8tx[9+LEN_RCSD]=1;//记录数据
					p8tx[10+LEN_RCSD]=0;//M条记录
					
					LEN_TxAPDU=11+LEN_RCSD;
					LENmax_TxSPACE-=LEN_TxAPDU+2;//保留2byte(1byte时间标签,1byte上报信息FollowReport OPTIONAL）
					
					fDATA=0;//有数据标志;0=没,1=有,2=表示发送缓冲不够
					NUM_READFILE=0;//读文件总次数
					UARTCtrl->REPORT_NUM_File=0;//1帧主动上报数据来自不同文件的个数
					FILECOUNT=96;//先上报文件计数大的数据
					
					while(1)
					{
						if(UARTCtrl->REPORT_NUM_File>=REPORT_NUMFILEmax)//上报数据的不同文件最大数
						{
							break;
						}
						if(fDATA==2)//有数据标志;0=没,1=有,2=表示发送缓冲不够
						{
							break;
						}
						file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
						for(filename=0;filename<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM);filename++)
						{
							if(fDATA==2)//有数据标志;0=没,1=有,2=表示发送缓冲不够
							{
								break;
							}
							if(filename==recordFILENAMEmax_FLASH)
							{
								file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
							}
							if(file->BLOCK_ENTRY)
							{
								if(file->FILECOUNT==FILECOUNT)
								{//计数号相同
									i=file->FILEID;
									if((i&0xff)==0)
									{//文件类型=0
										if(ProjectType==1)//方案类型
										{//普通采集方案
											i>>=20;
										#if (USER/100)==0//是电科院测试
										//---电科院测试软件，上报曲线数据为上上个任务时间数据---
											if(((i>>4)&0xf)==3)
											{//采集类型=3,曲线数据
												p8=(u8*)ADDR_6012_2_SDRAM+(id*LENper_6012_2);
												p8+=4+1;//执行频率   TI
												n=pTItoSECOND(p8);//TI转为秒值,入口:pTI无数据类型,出口:hex秒
												MR(ADDR_DATABUFF,(u32)&UARTCtrl->TaskTime[id].StdTime,7);
												pYYMDHMS_SubS_hex((u8*)ADDR_DATABUFF,n);//年年月日时分秒减S秒,返回减S秒后的年年月日时分秒
												n=Compare_DL698DataString(file->save_date_time_s,(u8*)ADDR_DATABUFF,7);//数据串比较(高位在低字节),p1和p2已在RAM中,返回:0=相同,1=不相同p1>p2,2=不相同p1<p2
												if(n!=2)
												{//没到上报时间,暂不报
													i=~fileid;//使i!=fileid
												}
											}
										//---电科院测试软件，上报曲线数据... RND---
										#endif
										}
										else
										{
											i>>=12;
											i&=0xff;
										}
										if(i==fileid)
										{//采集相同
										#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
											if(PORTn==GPRSPORT)
											{
												n=file->NUM_GPRSreport[reportid];
											}
											else
											{
												n=file->NUM_ENETreport[reportid];
											}
										#else
											n=file->NUM_GPRSorENETreport[reportid];
										#endif
											if(file->NUM_DATA>n)
											{//有数据需上报
												//读记录头
												ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF,NUM_RMmax*sizeof(RecordFileHead_TypeDef));
												RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_128KDATABUFF);
												FILE_OFFSET=0;//计算数据地址
												for(i=0;i<n;i++)
												{
													FILE_OFFSET+=RecordFileHead->LEN_DATA;
													RecordFileHead++;
												}
												i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
												if(i>=REPORT_NUMFILEmax)//上报数据的不同文件最大数
												{
													break;
												}
												UARTCtrl->REPORT_filename[i]=filename;//1帧主动上报数据不同文件名列表
												UARTCtrl->REPORT_NUM_Data[i]=0;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
												i++;
												UARTCtrl->REPORT_NUM_File=i;//1帧主动上报数据来自不同文件的个数
												while(1)
												{
													i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
													if(i)
													{
														i--;
													}
													n=UARTCtrl->REPORT_NUM_Data[i];
												#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
													if(PORTn==GPRSPORT)
													{
														n+=file->NUM_GPRSreport[reportid];
													}
													else
													{
														n+=file->NUM_ENETreport[reportid];
													}
												#else
													n+=file->NUM_GPRSorENETreport[reportid];
												#endif
													if(file->NUM_DATA<=n)
													{//没数据需上报
														break;
													}
													i=RecordFileHead->LEN_DATA;
													NUM_READFILE++;//读文件总次数
													if(NUM_READFILE>127)//读文件总次数
													{//读文件总次数，限制每次运行时间
														break;
													}
													if(p8tx[10+LEN_RCSD]>=127)//M条记录
													{
														fDATA=2;//有数据标志;0=没,1=有,2=表示发送缓冲不够
														break;
													}
													//取记录数据
													ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+FILE_OFFSET,(u8*)ADDR_128KDATABUFF+(64*1024),i);
													fRSD=0;//行选择有效标志
													switch(pRSD[1])//行选择
													{
														case 0:
												//不选择       [0]  NULL
															fRSD=1;//行选择有效标志
															break;
														case 1:
												//Selector1∷=SEQUENCE
												//{
												//  对象属性描述符  OAD，
												//  数值            Data
												//}
															fRSD=0;//行选择有效标志
															break;
														case 2:
												//Selector2∷=SEQUENCE
												//{
												//  对象属性描述符  OAD，
												//  起始值          Data，
												//  结束值          Data，
												//  数据间隔        Data
												//}
															fRSD=0;//行选择有效标志
															break;
														case 3:
												//Selector3∷=SEQUENCE OF Selector2
															fRSD=0;//行选择有效标志
															break;
														case 4:
												//Selector4∷=SEQUENCE
												//{
												//  采集启动时间  date_time_s，
												//  电能表集合    MS
												//}
															p8=(u8*)ADDR_DATABUFF;
															p8[0]=DataType_TSA;
															p8[1]=7;
															p8[2]=5;
															MR(ADDR_DATABUFF+3,ADDR_128KDATABUFF+(n*sizeof(RecordFileHead_TypeDef)),6);//数据的电能表地址
															fRSD=Compare_TSA_MS((u8 *)ADDR_6000_SDRAM,p8+1,pRSD+2+7);//比较TSA是否符合MS集合,入口:pADDR_6000已在RAM,pTSA,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
															break;
														case 5:
												//Selector5∷=SEQUENCE
												//{
												//  采集存储时间  date_time_s，
												//  电能表集合    MS
												//}
															p8=(u8*)ADDR_DATABUFF;
															p8[0]=DataType_TSA;
															p8[1]=7;
															p8[2]=5;
															MR(ADDR_DATABUFF+3,ADDR_128KDATABUFF+(n*sizeof(RecordFileHead_TypeDef)),6);//数据的电能表地址
															fRSD=Compare_TSA_MS((u8 *)ADDR_6000_SDRAM,p8+1,pRSD+2+7);//比较TSA是否符合MS集合,入口:pADDR_6000已在RAM,pTSA,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
															break;
														case 6:
												//Selector6∷=SEQUENCE
												//{
												//  采集启动时间起始值  date_time_s，
												//  采集启动时间结束值  date_time_s，
												//  时间间隔            TI，
												//  电能表集合          MS
												//}
															p8=(u8*)ADDR_DATABUFF;
															p8[0]=DataType_TSA;
															p8[1]=7;
															p8[2]=5;
															MR(ADDR_DATABUFF+3,ADDR_128KDATABUFF+(n*sizeof(RecordFileHead_TypeDef)),6);//数据的电能表地址
															fRSD=Compare_TSA_MS((u8 *)ADDR_6000_SDRAM,p8+1,pRSD+2+17);//比较TSA是否符合MS集合,入口:pADDR_6000已在RAM,pTSA,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
															break;
														case 7:
												//Selector7∷=SEQUENCE
												//{
												//  采集存储时间起始值  date_time_s，
												//  采集存储时间结束值  date_time_s，
												//  时间间隔            TI，
												//  电能表集合          MS
												//}
															p8=(u8*)ADDR_DATABUFF;
															p8[0]=DataType_TSA;
															p8[1]=7;
															p8[2]=5;
															MR(ADDR_DATABUFF+3,ADDR_128KDATABUFF+(n*sizeof(RecordFileHead_TypeDef)),6);//数据的电能表地址
															fRSD=Compare_TSA_MS((u8 *)ADDR_6000_SDRAM,p8+1,pRSD+2+17);//比较TSA是否符合MS集合,入口:pADDR_6000已在RAM,pTSA,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
															break;
														case 8:
												//Selector8∷=SEQUENCE
												//{
												//  采集成功时间起始值  date_time_s，
												//  采集成功时间结束值  date_time_s，
												//  时间间隔            TI，
												//  电能表集合          MS
												//}
															p8=(u8*)ADDR_DATABUFF;
															p8[0]=DataType_TSA;
															p8[1]=7;
															p8[2]=5;
															MR(ADDR_DATABUFF+3,ADDR_128KDATABUFF+(n*sizeof(RecordFileHead_TypeDef)),6);//数据的电能表地址
															fRSD=Compare_TSA_MS((u8 *)ADDR_6000_SDRAM,p8+1,pRSD+2+17);//比较TSA是否符合MS集合,入口:pADDR_6000已在RAM,pTSA,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
															break;
														case 9:
												//Selector9∷=SEQUENCE
												//{
												//  上第n次记录  unsigned
												//}
															if(file->FILECOUNT<=1)
															{//上报最近1次
																fRSD=1;//行选择有效标志
															}
															else
															{
																fRSD=0;//行选择有效标志
															}
															break;
														case 10:
												//Selector10∷=SEQUENCE
												//{
												//上n条记录  unsigned，
												//电能表集合  MS
												//}
															if(file->FILECOUNT<=1)
															{//上报最近1次
																p8=(u8*)ADDR_DATABUFF;
																p8[0]=DataType_TSA;
																p8[1]=7;
																p8[2]=5;
																MR(ADDR_DATABUFF+3,ADDR_128KDATABUFF+(n*sizeof(RecordFileHead_TypeDef)),6);//数据的电能表地址
																fRSD=Compare_TSA_MS((u8 *)ADDR_6000_SDRAM,p8+1,pRSD+2+1);//比较TSA是否符合MS集合,入口:pADDR_6000已在RAM,pTSA,pMS已在RAM并指向数据类型后的字节;出口:0=不符合,1=符合
															}
															else
															{
																fRSD=0;//行选择有效标志
															}
															break;
														default:
															fRSD=0;//行选择有效标志
															break;
													}
													if(fRSD)//行选择有效标志
													{//行选择后有数据需上报
														p8=(u8*)(ADDR_128KDATABUFF+(n*sizeof(RecordFileHead_TypeDef)));//数据的电能表地址
														i=Get_RecordFileData_RCSD(pRCSD+1,p8,(u8*)ADDR_128KDATABUFF+(64*1024),(u8*)ADDR_DATABUFF,LEN_DATABUFF,0);//记录表的列选择;入口:pRCSD指向接收的RCSD(无数据类型),pAddr,pRecord指向每只表记录地址和数据块开始,p8out指向数据发送缓冲;出口;记录选择数据的长度,0=没记录或错误
														if(i)
														{
															if(i<=LENmax_TxSPACE)
															{
																MR((u32)p8tx+LEN_TxAPDU,ADDR_DATABUFF,i);
																LEN_TxAPDU+=i;
																LENmax_TxSPACE-=i;
																p8tx[10+LEN_RCSD]++;//M条记录
																fDATA=1;//有数据标志;0=没,1=有,2=表示发送缓冲不够
															}
															else
															{
																if(fDATA)//有数据标志;0=没,1=有,2=表示发送缓冲不够
																{
																	fDATA=2;//有数据标志;0=没,1=有,2=表示发送缓冲不够
																	break;
																}
																//若单个数据缓冲不够则放弃本数据上报
																
