gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_REPORT.c
															}
														}
													}
													i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
													if(i)
													{
														i--;
													}
													UARTCtrl->REPORT_NUM_Data[i]++;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
													FILE_OFFSET+=RecordFileHead->LEN_DATA;
													RecordFileHead++;
												}
											}
										}
									}
								}
							}
							file++;
						}
						if(FILECOUNT==0)
						{
							break;
						}
						FILECOUNT--;
					}
					if(fDATA==0)//有数据标志
					{//没上报数据
						if(UARTCtrl->REPORT_NUM_File==0)//1帧主动上报数据来自不同文件的个数
						{
							REPORT_END(PORTn);//主动上报任务结束时间
						}
						else
						{
							//文件中已处理过的数据个数
							UARTCtrl->HostACK=5;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
							REPORT_complete(PORTn);//当前主动上报完成后处理(定时任务)
						}
						return;
					}				
					p8tx[LEN_TxAPDU+0]=0;//时间标签
					p8tx[LEN_TxAPDU+1]=0;//上报信息FollowReport OPTIONAL
					LEN_TxAPDU+=2;
					break;
				default:
					UARTCtrl->TaskTime[id].Run=2;//任务执行状态:0=未执行,1=执行中,2=已执行,3=执行中暂停,4=执行未完成
					return;
			}
		}
		
		i=MRR(ADDR_F101_2+1,1);//读取安全模式参数
		if(i==0)
		{//0—不启用安全模式参数、默认安全模式参数
			p8tx-=TxAPDUOffset;//TxAPDU存放开始地址
			p8tx[0]=0x68;
			//2byte长度域L
			p8tx[3]=0x83;//控制域C
			p8tx[4]=5;//TSA
			MR((u32)p8tx+5,ADDR_4001+2,6);
			Data_Inverse((u32)p8tx+5,6);//数据倒序(高低字节调换),入口Le>=2
			p8tx[11]=0;//客户机地址CA
			//2byte帧头校验HCS
			MR((u32)p8tx+14,(u32)p8tx+TxAPDUOffset,LEN_TxAPDU);
			//2byte校验
			LEN_Tx=14+LEN_TxAPDU+2;
			p8tx[LEN_Tx]=0x16;
			LEN_Tx++;
			UARTCtrl->TxByte=LEN_Tx;
			LEN_Tx-=2;
			p8tx[1]=LEN_Tx;
			p8tx[2]=LEN_Tx>>8;
		}
		else
		{//1—启用安全模式参数、默认安全模式参数
			p8tx-=TxAPDUOffset;//TxAPDU存放开始地址
			p8tx[0]=0x68;
			//2byte长度域L
			p8tx[3]=0x83;//控制域C
			p8tx[4]=5;//TSA
			MR((u32)p8tx+5,ADDR_4001+2,6);
			Data_Inverse((u32)p8tx+5,6);//数据倒序(高低字节调换),入口Le>=2
			p8tx[11]=0;//客户机地址CA
			//2byte帧头校验HCS
			p8tx[14]=0x10;//0x10,0x00,0x13,//安全传输
			p8tx[15]=0x00;//安全类别
			//明文长度
			if(LEN_TxAPDU<127)
			{
				p8tx[16]=LEN_TxAPDU;
				LEN_Tx=17;
			}
			else
			{
				p8tx[16]=0x82;
				p8tx[17]=LEN_TxAPDU>>8;
				p8tx[18]=LEN_TxAPDU;
				LEN_Tx=19;
			}
			i=TESAM_CMD_TxRx(0x80140103,LEN_TxAPDU,(u32)p8tx+TxAPDUOffset);//发送ESAM命令;返回:0=正确发收且返回9000,1=错误
			if(i)
			{//ESAM验证失败
				UARTCtrl->REPORT_NUM_File=0;//1帧主动上报数据来自不同文件的个数
				return;
			}
			MR((u32)p8tx+LEN_Tx,(u32)p8tx+TxAPDUOffset,LEN_TxAPDU);
			LEN_Tx+=LEN_TxAPDU;
			//02 0C 82 07 EF 22 99 AD 50 09 00 00 00 0F 04 FB 43 41 D0
			p8tx[LEN_Tx]=2;//随机数+数据MAC  [2]  RN_MAC
			p8tx[LEN_Tx+1]=12;
			MR((u32)p8tx+LEN_Tx+2,ADDR_UART7Rx+5,12);
			p8tx[LEN_Tx+2+12]=4;
			MR((u32)p8tx+LEN_Tx+15,ADDR_UART7Rx+5+12,4);
			LEN_Tx+=19;
			LEN_Tx+=3;//2byte校验,1byte 0x16
			UARTCtrl->TxByte=LEN_Tx;
			LEN_Tx-=2;
			p8tx[1]=LEN_Tx;
			p8tx[2]=LEN_Tx>>8;
		}
		
		Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
		UARTCtrl->Task=2;//2=等待单帧数据发送
		//发送帧缓存在DataBuff+LEN_UARTnTx,用以重发
		i=Get_ADDR_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲地址
		i+=Get_LEN_UARTnTx(PORTn);
		MW((u32)p8tx,i,LEN_Tx+2);
		//上报响应超时时间  TI
		p16time[0]=WaitHostACKMinTimer;//默认最小值
		UARTCtrl->REPORT_OVER_SECOND=WaitHostACKMinTimer;//上报响应超时时间寄存
		UARTCtrl->REPORT_NUMmax=0;//若主站没应答最大还需重发上报次数,每上报1次减1
		UARTCtrl->HostACK=5;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
		p8=(u8*)ADDR_601C_SDRAM+((TaskID&0xff)*LENper_601C);
		p8=Get_Element(p8,3,0,0);//计算元素地址,使用ADDR_128KDATABUFF
		if(p8)
		{
			i=MRR((u32)p8+1,3);
			i=TItoSECOND(i);//TI转为秒值,出口:hex秒
			if(i>WaitHostACKMaxTimer)
			{
				i=WaitHostACKMaxTimer;
			}
			if(i<WaitHostACKMinTimer)
			{
				i=WaitHostACKMinTimer;
			}
			p16time[0]=i;
			UARTCtrl->REPORT_OVER_SECOND=i;//上报响应超时时间寄存
		//最大上报次数
			i=p8[5];
			if(i>=1)
			{
				i--;
				UARTCtrl->REPORT_NUMmax=i;//若主站没应答最大还需重发上报次数,每上报1次减1
				if(i==0)
				{
					p16time[0]=0;
				}
			}
		}

	}
}




void EVENT_REPORT_complete(u32 PORTn,u32 ACK)//主动上报完成后处理(事件),入口:ACK=0没确认,1=确认
{
	u32 i;
	u32 x;
	u32 y;
	u32 z;
	u32 n;
	u32 filename;
	msFILE_TypeDef *file;
	UARTCtrl_TypeDef *UARTCtrl;
	EventFileHead_TypeDef* EventFileHead;
	ms_Type *ms;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	x=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
	UARTCtrl->REPORT_NUM_File=0;//1帧主动上报数据来自不同文件的个数
	
	if(UARTCtrl->HostACK==4)//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
	{
		ms=(ms_Type *)Get_ms();
		if((x!=0)&&(x<=REPORT_NUMFILEmax))
		{
			Comm_Ram->msFILEchange=0;//文件管理数据变化:0=变化,!=没变化
			for(i=0;i<x;i++)
			{
				filename=UARTCtrl->REPORT_filename[i];//当前正在上报数据的文件名,0xffff表示无效文件名
				if(filename<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM))
				{
					if(filename<recordFILENAMEmax_FLASH)
					{
						file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags+(filename*sizeof(msFILE_TypeDef)));
					}
					else
					{
						file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage+((filename-recordFILENAMEmax_FLASH)*sizeof(msFILE_TypeDef)));
					}
					n=UARTCtrl->REPORT_NUM_Data[i];
					if(n)
					{
					#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
						if(PORTn==GPRSPORT)
						{
							z=file->NUM_GPRSreport[0];//已上报数
							file->NUM_GPRSreport[0]=z+n;//当前正在上报数据的文件中包含有电能表的个数或事件个数
						}
						else
						{
							z=file->NUM_ENETreport[0];//已上报数
							file->NUM_ENETreport[0]=z+n;//当前正在上报数据的文件中包含有电能表的个数或事件个数
						}
					#else
							z=file->NUM_GPRSorENETreport[0];//已上报数
							file->NUM_GPRSorENETreport[0]=z+n;//当前正在上报数据的文件中包含有电能表的个数或事件个数
					#endif
						if((file->FILEID&0xff)!=2)
						{//非事件记录文件2,是0=全事件采集记录或5=DL645电能表主动上报
							continue;
						}
						//事件已上报标志
						y=file->NUM_DATA;
						ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF,y*sizeof(EventFileHead_TypeDef));
						EventFileHead=(EventFileHead_TypeDef*)(ADDR_128KDATABUFF+(z*sizeof(EventFileHead_TypeDef)));
						while(n--)
						{
							if(z<y)
							{
								if(EventFileHead->REPORT&1)//b0=上报标志0不需上报1需上报;b1=已上报GPRS,b2=已上报以太网,b3=
								{
									if(PORTn==GPRSPORT)
									{
										EventFileHead->REPORT|=2;//b0=上报标志0不需上报1需上报;b1=已上报GPRS,b2=已上报以太网,b3=
									}
									else
									{
										EventFileHead->REPORT|=4;//b0=上报标志0不需上报1需上报;b1=已上报GPRS,b2=已上报以太网,b3=
									}
									if(ACK)
									{
										EventFileHead->ACK=ACK;//上报确认:0=没确认,1=确认
									}
								}
								EventFileHead++;
								z++;
							}
						}
						ms->msfile_write(filename,0,(u8*)ADDR_128KDATABUFF,y*sizeof(EventFileHead_TypeDef));
					}
				}
			}
		}
		UARTCtrl->HostACK=0;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
	}
}


void EVENT_REPORT_Notification(u32 PORTn)//上报通知(事件)
{
	u32 i;
	u32 x;
	u32 n;
	u32 fileid;
	u32 OI;
	u32 LEN_Tx;
	u32 LEN_TxAPDU;
	u32 LENmax_TxSPACE;//最大还可发送的字节数
	u8* p8;
//	u32 FILECOUNT;
	u32 FILE_OFFSET;
	u32 fDATA;//有数据标志
	u32 NUM_READFILE;//读文件总次数
	u16* p16time;
	u8* p8tx;
	UARTCtrl_TypeDef *UARTCtrl;
	ClientConnectInfo_TypeDef *ClientConnectInfo;//客户机连接信息
	u32 filename;
	msFILE_TypeDef *file;
	ms_Type *ms;
	EventFileHead_TypeDef* EventFileHead;
	RecordFileHead_TypeDef* RecordFileHead;
	u32 NUM_RCSD;
	u32 LEN_RCSD;
	u8* pRCSD;
	u32 NUMmax_DATA;
	#if(USER/100)==15//安徽
	u8* p8s;
	u8* p8SOUR;
	u16* p16s;
	u8* p8Data;
	u32 j;
	u32 len;
	u32 Len;
	u8* p8t;
	DL698_SETLIB_TypeDef *pLib;
	#endif

#define TEST_REPORT_PORTn_RS232     0//0=否,1=是;测试用上报口为RS232
#if TEST_REPORT_PORTn_RS232==0
	if((PORTn!=GPRSPORT)&&(PORTn!=ENETPORT))
	{
		return;
	}
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(UARTCtrl->Task!=0)
	{
		return;
	}
	if(UARTCtrl->LinkTask!=101)
	{//链接任务0-99初始过程,100=建立连接,101=登录,102=发退出登录,103=退出登录,104=关机
		return;
	}
#else
//---用RS232口测试上报---
	if(PORTn!=RS232PORT)
	{
		return;
	}
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	if(UARTCtrl->Task!=0)
	{
		return;
	}
//---用RS232口测试上报 END---
#endif
	
	if((UARTCtrl->HostACK)&&(UARTCtrl->HostACK!=4))//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件
	{//有其他主动上报等待确认返回
		return;
	}
	i=Comm_Ram->DL698YMDHMS[6];
	if(UARTCtrl->REPORT_RTCS==i)//空闲时进入上报的RTC秒
	{
		return;
	}
	if((i&1)==0)
	{
		return;//当前时钟奇数秒,奇数报事件,偶数报定时任务
	}
	UARTCtrl->REPORT_RTCS=i;//空闲时进入上报的RTC秒
	i=MRR(ADDR_4300_8+1,1);//允许主动上报
	if(i==0)
	{//不允许主动上报
		UARTCtrl->REPORT_NUMmax=0;//若主站没应答最大还需重发上报次数,每上报1次减1
		//不需主动上报的文件数据上报计数处理
		/*
		Comm_Ram->msFILEchange=0;//文件管理数据变化:0=变化,!=没变化(1=管理数据保存,2=不需主动上报处理)
		file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
		for(filename=0;filename<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM);filename++)
		{
			if(filename==recordFILENAMEmax_FLASH)
			{
				file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
			}
			if(file->BLOCK_ENTRY)
			{
				
