gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_REPORT.c
			}
			file++;
		}
		*/
		return;
	}
	switch(PORTn)
	{
		case GPRSPORT:
			p16time=(u16*)&Terminal_Ram->GPRS_WaitHostACK_S_Timer;//29 GPRS主动上报等待主站确认秒定时器
			break;
		case ENETPORT:
			p16time=(u16*)&Terminal_Ram->ENET_WaitHostACK_S_Timer;//30 ENET主动上报等待主站确认秒定时器
			break;
		default:
		case RS232PORT:
			p16time=(u16*)&Terminal_Ram->RS232_WaitHostACK_S_Timer;//31 RS232主动上报等待主站确认秒定时器
			break;
	}
	if(p16time[0]!=0)
	{//上报响应超时时间没到
		return;
	}
	i=UARTCtrl->REPORT_NUMmax;//若主站没应答最大还需重发上报次数,每上报1次减1
	if(i)
	{
		i--;
		UARTCtrl->REPORT_NUMmax=i;//若主站没应答最大还需重发上报次数,每上报1次减1
		p16time[0]=UARTCtrl->REPORT_OVER_SECOND;//上报响应超时时间寄存
		//发送帧缓存在DataBuff+LEN_UARTnTx,用以重发
		p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
		p8=(u8*)Get_ADDR_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲地址
		i=Get_LEN_UARTnTx(PORTn);
		p8+=i;
		LEN_Tx=p8[1]|(p8[2]<<8);
		LEN_Tx+=2;
		if(LEN_Tx<=i)
		{
			MR((u32)p8tx,(u32)p8,LEN_Tx);
			UARTCtrl->TxByte=LEN_Tx;
			UARTCtrl->Task=2;//2=等待单帧数据发送
		}
		return;
	}
	ms=(ms_Type *)Get_ms();
	EVENT_REPORT_complete(PORTn,0);//主动上报完成后处理(事件),入口:ACK=0没确认,1=确认
	
//心跳优先
	if(PORTn==GPRSPORT)
	{
		if(Terminal_Ram->GPRSHeartBeat_S_Timer==0)//GPRS心跳秒定时器
		{
			return;
		}
	}
	if(PORTn==ENETPORT)
	{
		if(Terminal_Ram->ENETHeartBeat_S_Timer==0)//以太网心跳秒定时器
		{
			return;
		}
	}
//
	fDATA=0;//有数据标志;0=没,1=有,2=表示发送缓冲不够
	NUM_READFILE=0;//读文件总次数
	UARTCtrl->REPORT_NUM_File=0;//1帧主动上报数据来自不同文件的个数
	file=(msFILE_TypeDef*)(ADDR_msFILEmanage+LEN_msFILEunltFlags);
	for(filename=0;filename<(recordFILENAMEmax_FLASH+recordFILENAMEmax_RAM);filename++)
	{
		if(UARTCtrl->REPORT_NUM_File>=REPORT_NUMFILEmax)//上报数据的不同文件最大数
		{
			break;
		}
		if(fDATA==2)//有数据标志;0=没,1=有,2=表示发送缓冲不够
		{
			break;
		}
		if(filename==recordFILENAMEmax_FLASH)
		{
			file=(msFILE_TypeDef*)(ADDR_RAMmsFILEmanage);
		}
		if(file->BLOCK_ENTRY)
		{
			fileid=file->FILEID;
			if((fileid&0xff)==2)
			{//文件分类=2，事件记录
				x=file->NUM_DATA;
			#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
				if(PORTn==GPRSPORT)
				{
					n=file->NUM_GPRSreport[0];
				}
				else
				{
					n=file->NUM_ENETreport[0];
				}
			#else
				n=file->NUM_GPRSorENETreport[0];
			#endif
				if(x>n)
				{//有事件需上报
					i=x*sizeof(EventFileHead_TypeDef);
					if(i<=LEN_128KDATABUFF)
					{
						if(NUM_READFILE>127)//读文件总次数
						{//读文件总次数，限制每次搜索时间
							break;
						}
						ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF,i);
						NUM_READFILE++;//读文件总次数
						EventFileHead=(EventFileHead_TypeDef*)(ADDR_128KDATABUFF);
						FILE_OFFSET=0;//计算数据地址
						for(i=0;i<n;i++)
						{
							FILE_OFFSET+=EventFileHead->LEN_data[0]+(EventFileHead->LEN_data[1]<<8);
							EventFileHead++;
						}
						i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
						if(i>=REPORT_NUMFILEmax)//上报数据的不同文件最大数
						{
							break;
						}
						UARTCtrl->REPORT_filename[i]=filename;//1帧主动上报数据不同文件名列表
						UARTCtrl->REPORT_NUM_Data[i]=0;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
						i++;
						UARTCtrl->REPORT_NUM_File=i;//1帧主动上报数据来自不同文件的个数
						while(1)
						{
							i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
							if(i)
							{
								i--;
							}
							n=UARTCtrl->REPORT_NUM_Data[i];
						#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
							if(PORTn==GPRSPORT)
							{
								n+=file->NUM_GPRSreport[0];
							}
							else
							{
								n+=file->NUM_ENETreport[0];
							}
						#else
							n+=file->NUM_GPRSorENETreport[0];
						#endif
							if(file->NUM_DATA<=n)
							{//没数据需上报
								break;
							}
							if(EventFileHead->REPORT&1)//b0=上报标志0不需上报1需上报;b1=已上报GPRS,b2=已上报以太网,b3=
							{//需上报
								if(fDATA==0)//有数据标志;0=没,1=有,2=表示发送缓冲不够
								{
									p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
									LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
									LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
								#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
									ClientConnectInfo=ClientConnectInfo;
								#else
									//客户机接收缓冲长度
									ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
									i=ClientConnectInfo->LEN_Rx;
									i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
									if(i<2048)
									{
										i=2048;
									}
									if(i>(TxAPDUOffset+1))
									{//不为0
										i-=(TxAPDUOffset+1);
										if(LENmax_TxSPACE>i)
										{
											LENmax_TxSPACE=i;
										}
									}
								#endif
//APDU:88 02 01 
//01  SEQUENCE OF OAD，个数=?
//31 04 02 00  OAD
//06 OAD个数
//00 20 22 02 00 00 20 1e 02 00 00 20 20 02 00 00 20 24 02 00 00 33 00 02 00 00 f2 03 42 01  OAD列表
//01 Get-Result∷=CHOICE, [1]   DATA
//01 记录数m						
//06 00 00 00 31 1c 07 e1 03 10 0c 18 00 1c 07 e1 03 10 0c 18 00 00 01 02 02 02 51 45 00 00 00 16 00 02 02 51 45 10 00 00 16 00 02 02 11 00 11 00 00 00
									p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
									p8tx[0]=0x88;//上报通知 REPORT-Notification
									p8tx[1]=0x02;//上报若干个对象属性         [1] ReportNotificationList
															//上报若干个记录型对象属性   [2] ReportNotificationRecordList
									i=UARTCtrl->REPORT_PIID;
									i++;
									i&=0x3f;
									UARTCtrl->REPORT_PIID=i;
									p8tx[2]=i;//PIID
									p8tx[3]=0;//SEQUENCE OF OAD，个数=?
									LEN_TxAPDU=4;
									LENmax_TxSPACE-=LEN_TxAPDU+2;//保留2byte(1byte时间标签,1byte上报信息FollowReport OPTIONAL）
								}
								//事件OAD
								if(LENmax_TxSPACE<5)
								{
									if(fDATA)//有数据标志;0=没,1=有,2=表示发送缓冲不够
									{
										fDATA=2;//有数据标志;0=没,1=有,2=表示发送缓冲不够
										break;
									}
									//单个数据大于缓冲长度丢弃本数据上报
									i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
									if(i)
									{
										i--;
									}
									UARTCtrl->REPORT_NUM_Data[i]++;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
									FILE_OFFSET+=EventFileHead->LEN_data[0]+(EventFileHead->LEN_data[1]<<8);
									EventFileHead++;
									continue;
								}
								OI=file->FILEID;
								NUMmax_DATA=DEPTH_EventFile(OI>>16);//事件文件存储深度;返回:存储深度
								OI>>=8;
								p8tx[LEN_TxAPDU+0]=OI>>16;
								p8tx[LEN_TxAPDU+1]=OI>>8;
								p8tx[LEN_TxAPDU+2]=OI;
								p8tx[LEN_TxAPDU+3]=0x00;
								p8tx[LEN_TxAPDU+4]=0;//OAD个数=?
								LEN_Tx=5;
								LENmax_TxSPACE-=5;
								//OAD列表
								i=EventFileHead->LEN_data[0]+(EventFileHead->LEN_data[1]<<8);
								ms->msfile_read(filename,((2*NUMmax_DATA)*sizeof(EventFileHead_TypeDef))+FILE_OFFSET,(u8*)ADDR_128KDATABUFF+((2*NUMmax_DATA)*sizeof(EventFileHead_TypeDef)),i);
								i=EventFileHead->LEN_event[0]+(EventFileHead->LEN_event[1]<<8);
								p8=(u8*)ADDR_128KDATABUFF+((2*NUMmax_DATA)*sizeof(EventFileHead_TypeDef))+i;
								n=p8[1];
								p8tx[LEN_TxAPDU+4]=n;//OAD个数=?
								n*=5;
								if(LENmax_TxSPACE<(n+2))
								{
									if(fDATA)//有数据标志;0=没,1=有,2=表示发送缓冲不够
									{
										fDATA=2;//有数据标志;0=没,1=有,2=表示发送缓冲不够
										break;
									}
									//单个数据大于缓冲长度丢弃本数据上报
									i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
									if(i)
									{
										i--;
									}
									UARTCtrl->REPORT_NUM_Data[i]++;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
									FILE_OFFSET+=EventFileHead->LEN_data[0]+(EventFileHead->LEN_data[1]<<8);
									EventFileHead++;
									continue;
								}
								MR((u32)p8tx+LEN_TxAPDU+LEN_Tx,(u32)p8+2,n);
								p8tx[LEN_TxAPDU+LEN_Tx+n]=1;//Get-Result∷=CHOICE, [1]   DATA
								p8tx[LEN_TxAPDU+LEN_Tx+n+1]=1;//记录数m
								LEN_Tx+=n+2;
								LENmax_TxSPACE-=n+2;
								
