gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_REPORT.c
								i=EventFileHead->LEN_event[0]+(EventFileHead->LEN_event[1]<<8);
								i-=2;
								if(LENmax_TxSPACE<i)
								{
									if(fDATA)//有数据标志;0=没,1=有,2=表示发送缓冲不够
									{
										fDATA=2;//有数据标志;0=没,1=有,2=表示发送缓冲不够
										break;
									}
									//数据错误放弃本数据,单个数据大于缓冲长度丢弃本数据上报
									i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
									if(i)
									{
										i--;
									}
									UARTCtrl->REPORT_NUM_Data[i]++;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
									FILE_OFFSET+=EventFileHead->LEN_data[0]+(EventFileHead->LEN_data[1]<<8);
									EventFileHead++;
									continue;
								}
								MR((u32)p8tx+LEN_TxAPDU+LEN_Tx,ADDR_128KDATABUFF+((2*NUMmax_DATA)*sizeof(EventFileHead_TypeDef))+2,i);
								LEN_Tx+=i;
								LENmax_TxSPACE-=i;
								p8tx[3]++;//SEQUENCE OF OAD，个数=?
								LEN_TxAPDU+=LEN_Tx;
								#if(USER/100)==15//安徽
								if(OI==0x00310602)
								{
									p8t=Get_Element(p8tx+LEN_TxAPDU-i,4,0,0);//计算元素地址,使用ADDR_128KDATABUFF
									if(p8t==0)
										return;
								}
								if(OI==0x00310602&&p8t[1]==0)//停电事件上报数据处理
								{
									LEN_Tx=0;
									Len=0;
									for(i=0;i<NUMmax_6012_2;i++)
									{
										p8s=(u8*)ADDR_6012_2_SDRAM+(i*LENper_6012_2);//任务配置表
										if(p8s[0]==DataType_structure)
										{
											if(p8s[9]==1)
											{//普通采集方案
												pLib=Get_DL698_SET_pLib(0x31060B00);//得到DATA_pLib指针;入口:OAD;返回:Lib指针(=0表示无相应的OI)
												if(pLib==0)
													break;
												MR(ADDR_DATABUFF,pLib->Addr,4);
												p8t=(u8*)ADDR_DATABUFF;
												if(p8s[11]==p8t[3])
												{//方案编号
													p8SOUR=(u8*)ADDR_6000_SDRAM;
													for(i=0;i<NUMmax_6000;i++)
													{
														if(p8SOUR[0]==DataType_structure)
														{
															p16s=(u16*)(p8SOUR+10);//取采集档案配置序号的通信地址
															len=Get_LastRecordFileDataHasID(54,p16s);
															if(len!=0)//在数据记录里面有该TSA的数据
															{
																LEN_RCSD=0;
																if(Len==0)
																{
																	p8tx[LEN_TxAPDU+0]=0x60;
																	p8tx[LEN_TxAPDU+1]=0x12;
																	p8tx[LEN_TxAPDU+2]=0x03;
																	p8tx[LEN_TxAPDU+3]=0x00;
																	
																	p8Data=(u8*)ADDR_128KDATABUFF;
																	NUM_RCSD = p8Data[22];
																	p8tx[LEN_TxAPDU+4]=NUM_RCSD+1;
																	j=0;
																	for(n=0;n<NUM_RCSD;n++)
																	{
																		x=5;
																		MR((u32)p8tx+LEN_TxAPDU+5+LEN_RCSD,(u32)p8Data+j+24,x);
																		LEN_RCSD+=x;
																		j+=x+1;
																	}
																	p8tx[LEN_TxAPDU+5+LEN_RCSD]=0;//目标服务器地址OAD
																	p8tx[LEN_TxAPDU+6+LEN_RCSD]=0x20;
																	p8tx[LEN_TxAPDU+7+LEN_RCSD]=0x2A;
																	p8tx[LEN_TxAPDU+8+LEN_RCSD]=0x02;
																	p8tx[LEN_TxAPDU+9+LEN_RCSD]=0x00;
																	LEN_Tx+=10+LEN_RCSD;
																	LEN_TxAPDU+=10+LEN_RCSD;
																	LENmax_TxSPACE-=10+LEN_RCSD;
																	p8tx[LEN_TxAPDU]=1;
																	p8tx[LEN_TxAPDU+1]=0;
																}
																len-=23+j;
																p8tx[LEN_TxAPDU+1]++;									
																MR((u32)p8tx+LEN_TxAPDU+2+Len,(u32)p8Data+23+j,len);														
																p8tx[LEN_TxAPDU+2+len+Len]=0x55;//目标服务器地址数据
																p8tx[LEN_TxAPDU+3+len+Len]=0x07;
																p8tx[LEN_TxAPDU+4+len+Len]=0x05;
																MR((u32)p8tx+LEN_TxAPDU+5+len+Len,(u32)p16s,6);
																Len+=9+len;
															}
														}
														p8SOUR+=LENper_6000;
													}
												}
											}
										}
									}
									if(Len>0)
									{
										p8tx[3]++;
										LEN_Tx+=Len+2;
										LENmax_TxSPACE-=Len+2;
										LEN_TxAPDU+=Len+2;
									}
								}
								#endif
								fDATA=1;//有数据标志;0=没,1=有,2=表示发送缓冲不够
							}	
							i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
							if(i)
							{
								i--;
							}
							UARTCtrl->REPORT_NUM_Data[i]++;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
							FILE_OFFSET+=EventFileHead->LEN_data[0]+(EventFileHead->LEN_data[1]<<8);
							EventFileHead++;
							if(fDATA)
							{
								break;//文件有事件即上报,不同数据记录帧格式不同!
							}
						}
					}
				}
			}
	//电能表全事件采集上报
			if((fileid>>28)==2)
			{//事件采集方案
				x=file->NUM_DATA;
			#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
				if(PORTn==GPRSPORT)
				{
					n=file->NUM_GPRSreport[0];
				}
				else
				{
					n=file->NUM_ENETreport[0];
				}
			#else
				n=file->NUM_GPRSorENETreport[0];
			#endif
				if(x>n)
				{//有事件需上报
					i=x*sizeof(RecordFileHead_TypeDef);
					if(i<=LEN_128KDATABUFF)
					{
						if(NUM_READFILE>127)//读文件总次数
						{//读文件总次数，限制每次运行时间
							break;
						}
						NUM_READFILE++;//读文件总次数
						i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
						if(i>=REPORT_NUMFILEmax)//上报数据的不同文件最大数
						{
							break;
						}
						UARTCtrl->REPORT_filename[i]=filename;//1帧主动上报数据不同文件名列表
						UARTCtrl->REPORT_NUM_Data[i]=0;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
						i++;
						UARTCtrl->REPORT_NUM_File=i;//1帧主动上报数据来自不同文件的个数

						//读记录头
						ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF,x*sizeof(RecordFileHead_TypeDef));
						RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_128KDATABUFF);
						FILE_OFFSET=0;//计算数据地址
						for(i=0;i<n;i++)
						{
							FILE_OFFSET+=RecordFileHead->LEN_DATA;
							RecordFileHead++;
						}
						//取记录数据
						i=RecordFileHead->LEN_DATA;
						ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+FILE_OFFSET,(u8*)ADDR_128KDATABUFF+(64*1024),i);
	//TxAPDU：
	//88 上报通知
	//02 上报若干个记录型对象属性
	//02 PIID
	//01 SEQUENCE OF A-ResultNormal
	//60 12 03 00  OAD
	//01 RCSD，SEQUENCE OF个数=1
	//01 50 04 02 00 02 00 10 02 00 00 20 02 00 //RCSD
	//01 记录数据
	//02 M条记录，M=2
	//01 02 01 05 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 01 05 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 
	//01 02 01 05 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 01 05 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 06 00 00 00 00 
	//00 00 
						p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
						LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
						LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
					#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
						ClientConnectInfo=ClientConnectInfo;
					#else
						//客户机接收缓冲长度
						ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
						i=ClientConnectInfo->LEN_Rx;
						i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
						if(i<2048)
						{
							i=2048;
						}
						if(i>(TxAPDUOffset+1))
						{//不为0
							i-=(TxAPDUOffset+1);
							if(LENmax_TxSPACE>i)
							{
								LENmax_TxSPACE=i;
							}
						}
					#endif
						p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
						p8tx[0]=0x88;//上报通知 REPORT-Notification
						p8tx[1]=0x02;//上报若干个对象属性[1] ReportNotificationList,上报若干个记录型对象属性   [2] ReportNotificationRecordList
						i=UARTCtrl->REPORT_PIID;
						i++;
						i&=0x3f;
						UARTCtrl->REPORT_PIID=i;
						p8tx[2]=i;//PIID
						p8tx[3]=1;//SEQUENCE OF A-ResultNormal
						p8tx[4]=0x60;
						p8tx[5]=0x12;
						p8tx[6]=0x03;
						p8tx[7]=0x00;
						
						LEN_RCSD=0;//无类型的RCSD长度
						p8tx[9+LEN_RCSD]=0;//OAD
						p8tx[10+LEN_RCSD]=0x60;//0x60400200://采集启动时标
						p8tx[11+LEN_RCSD]=0x40;
						p8tx[12+LEN_RCSD]=0x02;
						p8tx[13+LEN_RCSD]=0x00;
						LEN_RCSD+=5;
						p8tx[9+LEN_RCSD]=0;//OAD
						p8tx[10+LEN_RCSD]=0x60;//0x60410200://采集成功时标
						p8tx[11+LEN_RCSD]=0x41;
						p8tx[12+LEN_RCSD]=0x02;
						p8tx[13+LEN_RCSD]=0x00;
						LEN_RCSD+=5;
						p8tx[9+LEN_RCSD]=0;//OAD
						p8tx[10+LEN_RCSD]=0x60;//0x60420200://采集存储时标
						p8tx[11+LEN_RCSD]=0x42;
						p8tx[12+LEN_RCSD]=0x02;
						p8tx[13+LEN_RCSD]=0x00;
						LEN_RCSD+=5;
						p8tx[9+LEN_RCSD]=0;//OAD
						p8tx[10+LEN_RCSD]=0x20;//0x202A0200://目标服务器地址
						p8tx[11+LEN_RCSD]=0x2A;
						p8tx[12+LEN_RCSD]=0x02;
						p8tx[13+LEN_RCSD]=0x00;
						LEN_RCSD+=5;

						pRCSD=(u8*)ADDR_128KDATABUFF+(64*1024)+21;
						NUM_RCSD=pRCSD[1];//RCSD，SEQUENCE OF个数
						p8tx[8]=NUM_RCSD+(LEN_RCSD/5);//+目标服务器地址等
						//文件中有类型RCSD转为无类型的RCSD
						i=2;//文件中有类型的RCSD长度
						for(n=0;n<NUM_RCSD;n++)
						{
							if(pRCSD[i+1]==0)
							{//OAD
								x=5;
								MR((u32)p8tx+9+LEN_RCSD,(u32)pRCSD+i+1,x);
								LEN_RCSD+=x;
								i+=x+1;
							}
							else
							{//ROAD
								x=pRCSD[i+6];
								x*=4;
								x+=6;
								MR((u32)p8tx+9+LEN_RCSD,(u32)pRCSD+i+1,x);
								LEN_RCSD+=x;
								i+=x+1;
							}
						}
						p8tx[9+LEN_RCSD]=1;//记录数据
						p8tx[10+LEN_RCSD]=0;//M条记录
						
						LEN_TxAPDU=11+LEN_RCSD;
						LENmax_TxSPACE-=LEN_TxAPDU+2;//保留2byte(1byte时间标签,1byte上报信息FollowReport OPTIONAL）	
					#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
						if(PORTn==GPRSPORT)
						{
							n=file->NUM_GPRSreport[0];
						}
						else
						{
							n=file->NUM_ENETreport[0];
						}
					#else
						n=file->NUM_GPRSorENETreport[0];
					#endif
						p8=(u8*)(ADDR_128KDATABUFF+(n*sizeof(RecordFileHead_TypeDef)));//数据的电能表地址
						i=Get_RecordFileData_RCSD(p8tx+8,p8,(u8*)ADDR_128KDATABUFF+(64*1024),(u8*)ADDR_DATABUFF,LEN_DATABUFF,0);//记录表的列选择;入口:pRCSD指向接收的RCSD(无数据类型),pAddr,pRecord指向每只表记录地址和数据块开始,p8out指向数据发送缓冲;出口;记录选择数据的长度,0=没记录或错误
						if(i)
						{
							if(i<=LENmax_TxSPACE)
							{
								MR((u32)p8tx+LEN_TxAPDU,ADDR_DATABUFF,i);
								LEN_TxAPDU+=i;
								LENmax_TxSPACE-=i;
								p8tx[10+LEN_RCSD]++;//M条记录
								fDATA=1;//有数据标志;0=没,1=有,2=表示发送缓冲不够
							}
						}
						i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
						if(i)
						{
							i--;
						}
						UARTCtrl->REPORT_NUM_Data[i]++;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
						if(fDATA)
						{
							break;//文件有事件即上报,不同数据记录帧格式不同!
						}

