gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_REPORT.c
					}
				}
			}
	//DL645电能表主动上报
			if((fileid&0xff)==5)
			{//文件分类=5
				x=file->NUM_DATA;
			#if GPRS_ENET_REPORT==0//GPRS/ENET主动上报:0=上报分开,1=上报合并
				if(PORTn==GPRSPORT)
				{
					n=file->NUM_GPRSreport[0];
				}
				else
				{
					n=file->NUM_ENETreport[0];
				}
			#else
				n=file->NUM_GPRSorENETreport[0];
			#endif
				if(x>n)
				{//有事件需上报
					i=x*sizeof(RecordFileHead_TypeDef);
					if(i<=LEN_128KDATABUFF)
					{
						if(NUM_READFILE>127)//读文件总次数
						{//读文件总次数，限制每次运行时间
							break;
						}
						NUM_READFILE++;//读文件总次数
						i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
						if(i>=REPORT_NUMFILEmax)//上报数据的不同文件最大数
						{
							break;
						}
						UARTCtrl->REPORT_filename[i]=filename;//1帧主动上报数据不同文件名列表
						UARTCtrl->REPORT_NUM_Data[i]=0;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
						i++;
						UARTCtrl->REPORT_NUM_File=i;//1帧主动上报数据来自不同文件的个数

						//读记录头
						ms->msfile_read(filename,0,(u8*)ADDR_128KDATABUFF,x*sizeof(RecordFileHead_TypeDef));
						RecordFileHead=(RecordFileHead_TypeDef*)(ADDR_128KDATABUFF);
						FILE_OFFSET=0;//计算数据地址
						for(i=0;i<n;i++)
						{
							FILE_OFFSET+=RecordFileHead->LEN_DATA;
							RecordFileHead++;
						}
						//取记录数据
						i=RecordFileHead->LEN_DATA;
						ms->msfile_read(filename,(NUM_RMmax*sizeof(RecordFileHead_TypeDef))+FILE_OFFSET,(u8*)ADDR_128KDATABUFF+(64*1024),i);
	//ReportNotificationTransData∷=SEQUENCE 
	//{ 
	//	服务序号-优先级-ACD PIID-ACD， 
	//	数据来源端口号 OAD， 
	//	透明数据 SEQUENCE OF octet-string 
	//}
	//TxAPDU：
	//88 上报通知
	//03 上报透明数据 [3] ReportNotificationTransData
	//02 服务序号-优先级-ACD PIID-ACD
	//F2 01 02 01  数据来源端口号 OAD
	//01 透明数据 SEQUENCE OF octet-string 
						p8tx=(u8 *)Get_ADDR_UARTnTx(PORTn);
						LENmax_TxSPACE=Get_LEN_UARTnTx(PORTn);//最大还可发送的字节数
						LENmax_TxSPACE-=TxAPDUOffset+1;//1byte上报信息FollowReport OPTIONAL=0 表示没有
					#if USE_ClientConnectInfo==0//使用客户机连接信息的客户机最大接收字节:0=不使用,1=使用
						ClientConnectInfo=ClientConnectInfo;
					#else
						//客户机接收缓冲长度
						ClientConnectInfo=(ClientConnectInfo_TypeDef*)UARTCtrl->ConnectInfo;//客户机连接信息
						i=ClientConnectInfo->LEN_Rx;
						i=R_Inverse(i,2);//寄存器数据倒序(高低字节调换),入口:Data=寄存器中数据,Byte=需倒序的字节数;返回:倒序后的数据
						if(i<2048)
						{
							i=2048;
						}
						if(i>(TxAPDUOffset+1))
						{//不为0
							i-=(TxAPDUOffset+1);
							if(LENmax_TxSPACE>i)
							{
								LENmax_TxSPACE=i;
							}
						}
					#endif
						p8tx+=TxAPDUOffset;//TxAPDU存放开始地址
						p8tx[0]=0x88;//上报通知 REPORT-Notification
						p8tx[1]=0x03;//上报透明数据 [3] ReportNotificationTransData
						i=UARTCtrl->REPORT_PIID;
						i++;
						i&=0x3f;
						UARTCtrl->REPORT_PIID=i;
						p8tx[2]=i;//PIID
						LEN_TxAPDU=3;
						LENmax_TxSPACE-=LEN_TxAPDU+2;//保留2byte(1byte时间标签,1byte上报信息FollowReport OPTIONAL）	
						
						i=RecordFileHead->LEN_DATA;
						if(i<=LENmax_TxSPACE)
						{
							MR((u32)p8tx+LEN_TxAPDU,ADDR_128KDATABUFF+(64*1024),i);
							LEN_TxAPDU+=i;
							LENmax_TxSPACE-=i;
							fDATA=1;//有数据标志;0=没,1=有,2=表示发送缓冲不够
						}

						i=UARTCtrl->REPORT_NUM_File;//1帧主动上报数据来自不同文件的个数
						if(i)
						{
							i--;
						}
						UARTCtrl->REPORT_NUM_Data[i]++;//1帧主动上报数据不同文件名中已处理数据个数列表,包括没任何列选中的个数
						if(fDATA)
						{
							break;//文件有事件即上报,不同数据记录帧格式不同!
						}
					}
				}
			}
			//
			
		}
		file++;
	}
	if(fDATA==0)//有数据标志
	{//没上报数据
		if(UARTCtrl->REPORT_NUM_File)//1帧主动上报数据来自不同文件的个数
		{
			//文件中已处理过的数据个数
			UARTCtrl->HostACK=4;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
			EVENT_REPORT_complete(PORTn,0);//主动上报完成后处理(事件),入口:ACK=0没确认,1=确认
		}
		return;
	}		
	p8tx[LEN_TxAPDU+0]=0;//时间标签
	p8tx[LEN_TxAPDU+1]=0;//上报信息FollowReport OPTIONAL
	LEN_TxAPDU+=2;
			
	i=MRR(ADDR_F101_2+1,1);//读取安全模式参数
	if(i==0)
	{//0—不启用安全模式参数、默认安全模式参数
		p8tx-=TxAPDUOffset;//TxAPDU存放开始地址
		p8tx[0]=0x68;
		//2byte长度域L
		p8tx[3]=0x83;//控制域C
		p8tx[4]=5;//TSA
		MR((u32)p8tx+5,ADDR_4001+2,6);
		Data_Inverse((u32)p8tx+5,6);//数据倒序(高低字节调换),入口Le>=2
		p8tx[11]=0;//客户机地址CA
		//2byte帧头校验HCS
		MR((u32)p8tx+14,(u32)p8tx+TxAPDUOffset,LEN_TxAPDU);
		//2byte校验
		LEN_Tx=14+LEN_TxAPDU+2;
		p8tx[LEN_Tx]=0x16;
		LEN_Tx++;
		UARTCtrl->TxByte=LEN_Tx;
		LEN_Tx-=2;
		p8tx[1]=LEN_Tx;
		p8tx[2]=LEN_Tx>>8;
	}
	else
	{//1—启用安全模式参数、默认安全模式参数
		p8tx-=TxAPDUOffset;//TxAPDU存放开始地址
		p8tx[0]=0x68;
		//2byte长度域L
		p8tx[3]=0x83;//控制域C
		p8tx[4]=5;//TSA
		MR((u32)p8tx+5,ADDR_4001+2,6);
		Data_Inverse((u32)p8tx+5,6);//数据倒序(高低字节调换),入口Le>=2
		p8tx[11]=0;//客户机地址CA
		//2byte帧头校验HCS
		p8tx[14]=0x10;//0x10,0x00,0x13,//安全传输
		p8tx[15]=0x00;//安全类别
		//明文长度
		if(LEN_TxAPDU<127)
		{
			p8tx[16]=LEN_TxAPDU;
			LEN_Tx=17;
		}
		else
		{
			p8tx[16]=0x82;
			p8tx[17]=LEN_TxAPDU>>8;
			p8tx[18]=LEN_TxAPDU;
			LEN_Tx=19;
		}
		i=TESAM_CMD_TxRx(0x80140103,LEN_TxAPDU,(u32)p8tx+TxAPDUOffset);//发送ESAM命令;返回:0=正确发收且返回9000,1=错误
		if(i)
		{//ESAM验证失败
			UARTCtrl->REPORT_NUM_File=0;//1帧主动上报数据来自不同文件的个数
			return;
		}
		MR((u32)p8tx+LEN_Tx,(u32)p8tx+TxAPDUOffset,LEN_TxAPDU);
		LEN_Tx+=LEN_TxAPDU;
		//02 0C 82 07 EF 22 99 AD 50 09 00 00 00 0F 04 FB 43 41 D0
		p8tx[LEN_Tx]=2;//随机数+数据MAC  [2]  RN_MAC
		p8tx[LEN_Tx+1]=12;
		MR((u32)p8tx+LEN_Tx+2,ADDR_UART7Rx+5,12);
		p8tx[LEN_Tx+2+12]=4;
		MR((u32)p8tx+LEN_Tx+15,ADDR_UART7Rx+5+12,4);
		LEN_Tx+=19;
		LEN_Tx+=3;//2byte校验,1byte 0x16
		UARTCtrl->TxByte=LEN_Tx;
		LEN_Tx-=2;
		p8tx[1]=LEN_Tx;
		p8tx[2]=LEN_Tx>>8;
	}
	
	Uart_698_HCSFCS(p8tx);//整帧校验计算(HCS和FCS),同时加结束0x16;返回0=正确，1=错误
	UARTCtrl->Task=2;//2=等待单帧数据发送
	//发送帧缓存在DataBuff+LEN_UARTnTx,用以重发
	i=Get_ADDR_UARTnFnDataBuff(PORTn);//得到UART抄表数据缓冲地址
	i+=Get_LEN_UARTnTx(PORTn);
	MW((u32)p8tx,i,LEN_Tx+2);
	//上报响应超时时间  TI
	p16time[0]=WaitHostACKMinTimer;//默认最小值
	UARTCtrl->REPORT_OVER_SECOND=WaitHostACKMinTimer;//上报响应超时时间寄存
	UARTCtrl->REPORT_NUMmax=0;//若主站没应答最大还需重发上报次数,每上报1次减1
	UARTCtrl->HostACK=4;//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
	if(PORTn==GPRSPORT)
	{//公网通信模块1
		p8=Get_Element((u8 *)ADDR_4500_2,11,0,LENmax_4500_2);//计算元素地址,使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
		
	}
	else
	{//以太网通信模块1,其他口
		p8=Get_Element((u8 *)ADDR_4510_2,7,0,LENmax_4510_2);//计算元素地址,使用ADDR_128KDATABUFF;出口:地址指向元素的类型字节,0=错误
	}
	if(p8)
	{
		x=p8[1];//bit7~bit2：超时时间（秒），bit1~bit0：重发次数
		i=x>>2;
		if(i>WaitHostACKMaxTimer)
		{
			i=WaitHostACKMaxTimer;
		}
		if(i<WaitHostACKMinTimer)
		{
			i=WaitHostACKMinTimer;
		}
		p16time[0]=i;
		UARTCtrl->REPORT_OVER_SECOND=i;//上报响应超时时间寄存
		//最大上报次数
		i=x&0x3;
		if(i>=1)
		{
			i--;
			UARTCtrl->REPORT_NUMmax=i;//若主站没应答最大还需重发上报次数,每上报1次减1
			if(i==0)
			{
				p16time[0]=0;
			}
		}
	}
	
