gdgly/NUC97X_JS/STM32F4xx/DL698/DL698_REPORT.c
//u32 Event_3106(u8* pOccurSour,u32 Occur);//终端停/上电事件记录;入口:f=属性标志,pOccurSour产生源=0表示空,occur=0恢复=1产生=2无;返回:0=没记录,1=记录;使用ADDR_DATABUFF和ADDR_128KDATABUFF
//Event_3106(0,1);//终端停/上电事件记录
	
	
}


//REPORT-Response∷=CHOICE
//{
//上报若干个对象属性的响应      	 [1] ReportResponseList，
//上报若干个记录型对象属性的响应	 [2] ReportResponseRecordList
//}
void REPORT_Response(u32 PORTn)//上报应答
{
	u32 LEN_SA;
	u8* p8rx;
	UARTCtrl_TypeDef *UARTCtrl;
	u16 *p16time;
	
	UARTCtrl=(UARTCtrl_TypeDef *)Get_ADDR_UARTnCtrl(PORTn);
	p8rx=(u8 *)Get_ADDR_UARTnRx(PORTn);
	LEN_SA=p8rx[4];//取地址字节数
	LEN_SA&=0x0f;
	LEN_SA++;
	switch(p8rx[LEN_SA+8+1])
	{
		case 1://上报若干个对象属性的响应      	 [1] ReportResponseList

			break;
		case 2://上报若干个记录型对象属性的响应	 [2] ReportResponseRecordList
			
			break;
	}
	switch(PORTn)
	{
		case GPRSPORT:
			p16time=(u16*)&Terminal_Ram->GPRS_WaitHostACK_S_Timer;//29 GPRS主动上报等待主站确认秒定时器
			break;
		case ENETPORT:
			p16time=(u16*)&Terminal_Ram->ENET_WaitHostACK_S_Timer;//30 ENET主动上报等待主站确认秒定时器
			break;
		default:
		case RS232PORT:
			p16time=(u16*)&Terminal_Ram->RS232_WaitHostACK_S_Timer;//31 RS232主动上报等待主站确认秒定时器
			break;
	}
	if(UARTCtrl->HostACK==4)//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
	{
		p16time[0]=0;
		UARTCtrl->REPORT_NUMmax=0;//若主站没应答最大还需重发上报次数,每上报1次减1
		UARTCtrl->REPORT_RTCS=0xff;//空闲时进入上报的RTC秒
		EVENT_REPORT_complete(PORTn,1);//主动上报完成后处理(事件),入口:ACK=0没确认,1=确认
	}
	if(UARTCtrl->HostACK==5)//主动上报需主站确认帧标记:0=无,1=登录帧,2=退出登录帧,3=心跳帧,4=重要事件,5=定时任务,6=电能表事件,7=终端请求主站时钟
	{
		p16time[0]=0;
		UARTCtrl->REPORT_NUMmax=0;//若主站没应答最大还需重发上报次数,每上报1次减1
		UARTCtrl->REPORT_RTCS=0xff;//空闲时进入上报的RTC秒
		REPORT_complete(PORTn);//主动上报完成后处理(定时任务)
	}

}








